Revit 2027 API
EnergyDataSettings.SetReportsFolder Method
 Sets the reports folder path.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetReportsFolder(
	string folderPath
)
Public Sub SetReportsFolder (
	folderPath As String
)
public:
void SetReportsFolder(
	String^ folderPath
)
member SetReportsFolder :
        folderPath : string -> unit
Parameters
folderPath String
 The string to specify the path. It may include the special label for project name.
Exceptions
Exception | Condition
ArgumentException |  A folder path cannot contain special characters.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace